app/views/pages/home.html.erb

SELECT COUNT(*) FROM "courses"
---
    <h2>Total Courses</h2>
    <p><%= Course.count %></p>

SELECT COUNT(*) FROM "blogs"
---
    <h2>Announcements</h2>
    <p><%= Blog.count %> Posts</p>