app/views/certificates/_form.html.erb

SELECT "users".* FROM "users"
---
    <%= form.label :user_id %>
    <%= form.collection_select :user_id, User.all, :id, :name, { prompt: "Select a user" }, { class: "block shadow rounded-md border border-gray-200 outline-none px-3 py-2 mt-2 w-full" } %>