app/controllers/attendances_controller.rb

SELECT "attendances".* FROM "attendances" ORDER BY "attendances"."date" DESC
---
  def index
    @attendances = Attendance.all.order(date: :desc)