app/controllers/attendances_controller.rb

SELECT "attendances".* FROM "attendances"
---
  def index
    @attendances = Attendance.all

INSERT INTO "attendances" ("academic_class_id", "date", "created_at", "updated_at", "course_id", "status") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["academic_class_id", nil], ["date", "2025-05-27 00:00:00"], ["created_at", "2025-05-27 18:59:58.679525"], ["updated_at", "2025-05-27 18:59:58.679525"], ["course_id", 3], ["status", "present"]]
---
  def create
    @attendance = Attendance.new(attendance_params)

    respond_to do |format|
      if @attendance.save

UPDATE "attendances" SET "date" = $1, "updated_at" = $2, "course_id" = $3 WHERE "attendances"."id" = $4  [["date", "2025-05-26 00:00:00"], ["updated_at", "2025-05-27 17:02:50.772763"], ["course_id", 1], ["id", 1]]
---
  def update
    respond_to do |format|
      if @attendance.update(attendance_params)

SELECT "attendances".* FROM "attendances" WHERE "attendances"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_attendance
      @attendance = Attendance.find(params[:id])