app/controllers/certificates_controller.rb

  def index
    @certificates = Certificate.all
---
SELECT "certificates".* FROM "certificates"

  def create
    @certificate = Certificate.new(certificate_params)

    respond_to do |format|
      if @certificate.save
---
INSERT INTO "certificates" ("name", "qr_code", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Umair Ahmad Zubair"], ["qr_code", "9cfb685809e74305f2cf"], ["user_id", 1], ["created_at", "2025-05-23 19:35:59.314211"], ["updated_at", "2025-05-23 19:35:59.314211"]]

    def set_certificate
      @certificate = Certificate.find(params[:id])
---
SELECT "certificates".* FROM "certificates" WHERE "certificates"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]