app/controllers/courses_controller.rb

  def create
    @course = Course.new(course_params)

    respond_to do |format|
      if @course.save
---
INSERT INTO "courses" ("name", "start_date", "duration", "price", "created_at", "updated_at", "instructor_name") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    respond_to do |format|
      if @course.update(course_params)
---
UPDATE "courses" SET "updated_at" = $1, "instructor_name" = $2 WHERE "courses"."id" = $3  [["updated_at", "2025-05-27 17:03:07.178758"], ["instructor_name", "Sir Usman"], ["id", 1]]

  def destroy
    @course.destroy!
---
DELETE FROM "courses" WHERE "courses"."id" = $1  [["id", 2]]