app/controllers/grades_controller.rb

SELECT "grades".* FROM "grades"
---
  def index
    @grades = Grade.all

INSERT INTO "grades" ("value", "user_id", "academic_class_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["value", "D"], ["user_id", 1], ["academic_class_id", 1], ["created_at", "2025-05-23 19:35:37.491429"], ["updated_at", "2025-05-23 19:35:37.491429"]]
---
  def create
    @grade = Grade.new(grade_params)

    respond_to do |format|
      if @grade.save

SELECT "grades".* FROM "grades" WHERE "grades"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_grade
      @grade = Grade.find(params[:id])