app/controllers/pages_controller.rb

SELECT "courses".* FROM "courses" ORDER BY created_at DESC LIMIT $1  [["LIMIT", 5]]
SELECT "blogs".* FROM "blogs" ORDER BY created_at DESC LIMIT $1  [["LIMIT", 5]]
---
  def home
    @latest_courses = Course.order("created_at DESC").limit(5)
    @latest_blogs = Blog.order("created_at DESC").limit(5)