app/views/attendances/_form.html.erb

SELECT "courses".* FROM "courses"
---
      <%= form.label :course_id, class: "form-label" %>
      <%= form.collection_select :course_id, Course.all, :id, :name,
                                 { prompt: "Select a course" },
                                 { class: "form-control", onchange: "updateInstructorName()" } %>

SELECT "courses".* FROM "courses" WHERE "courses"."id" IS NULL LIMIT $1  [["LIMIT", 1]]
---
      <div id="instructor-display" class="form-control" style="background-color: #f8f9fa;">
        <%= Course.find_by(id: attendance.course_id)&.instructor_name || "Select a course to see instructor" %>